Revit 2027 API
KeynoteEntries.LoadKeynoteEntriesFromFile Method
 Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool LoadKeynoteEntriesFromFile(
	string filePath,
	KeyBasedTreeEntriesLoadContent keynoteContent
)
Public Shared Function LoadKeynoteEntriesFromFile (
	filePath As String,
	keynoteContent As KeyBasedTreeEntriesLoadContent
) As Boolean
public:
static bool LoadKeynoteEntriesFromFile(
	String^ filePath,
	KeyBasedTreeEntriesLoadContent^ keynoteContent
)
static member LoadKeynoteEntriesFromFile :
        filePath : string *
        keynoteContent : KeyBasedTreeEntriesLoadContent -> bool
Parameters
filePath String
 The full path of the existing keynotefile.
keynoteContent KeyBasedTreeEntriesLoadContent
 The keynote entries read from the filePath will be added to this object. A KeyBasedTreeEntriesLoadContent object will also be updated to contain status information, including information about any errors that occurred while reading the keynote entries from the specified file.
Return Value
Boolean
 True if reading the keynote file succeeds; False if the keynote file cannot be read.
Exceptions
Exception | Condition
ArgumentException |  filePath is an empty string. -or- The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is built already. Adding more KeyBasedTreeEntries as well as repeated building, is not supported.
ArgumentNullException |  A non-optional argument was null
InvalidPathArgumentException |  The destination file name includes one or more invalid characters.
Remarks
 The entries read from the file will be added to any existing entries read from other files before this reading operation in the provided KeyBasedTreeEntriesLoadContent. if file A was read, and then file B was failed to read, all the entries from file A will still be there to build KeynoteEntries object.
See Also
Reference
KeynoteEntries Class
Autodesk.Revit.DB Namespace